# WoodPerpendicularShearStrength Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralAsset..::..WoodPerpendicularShearStrength Property
StructuralAsset Class See Also
---
The perpendicular shear strength of the asset.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double WoodPerpendicularShearStrength { get; set; }
```

Visual Basic
---
```text
Public Property WoodPerpendicularShearStrength As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double WoodPerpendicularShearStrength {
	double get ();
	void set (double value);
}
```

# Remarks
Applies to wood-based structural assets. The value is in Newtons per foot meter (N/(ft · m)).
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InapplicableDataException | When setting this property: the material type must be wood to set this property. |

# See Also
StructuralAsset Class
Autodesk.Revit.DB Namespace